[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:76:17
                 )
               }
               {
-                !hasRole(currentUser, "ROLE_RIDER") && (
-                  <Nav.Link id="appnavbar-ride-requests" data-testid="appnavbar-ride-requests" href="/ride-requests">Ride Requests</Nav.Link>
-                )
+                false
               }
               {
killedBy: AppNavbar tests renders ride request links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-ride-requests"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:76:17
                 )
               }
               {
-                !hasRole(currentUser, "ROLE_RIDER") && (
-                  <Nav.Link id="appnavbar-ride-requests" data-testid="appnavbar-ride-requests" href="/ride-requests">Ride Requests</Nav.Link>
-                )
+                true
               }
               {
killedBy: AppNavbar tests renders ride request links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-ride-requests"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:81:17
                 )
               }
               {
-                (hasRole(currentUser, "ROLE_RIDER") || hasRole(currentUser, "ROLE_ADMIN")) && (
-                  <Nav.Link id="appnavbar-rider-dashboard" data-testid="appnavbar-rider-dashboard" href="/rider">Rider</Nav.Link>
-                )
+                true
               }
             </Nav>
killedBy: AppNavbar tests renders ride request links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-rider-dashboard"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"
