[Survived] BooleanLiteral
src/main/pages/ProfilePage.js:11:43
 const ProfilePage = () => {
 
 
-    const [showModal, setShow] = useState(false);
+    const [showModal, setShow] = useState(true);
     const [userCellPhone, setUserCellPhone] = useState("");
     const handleClose = () => setShow(false);

[Survived] StringLiteral
src/main/pages/ProfilePage.js:12:56
 
 
     const [showModal, setShow] = useState(false);
-    const [userCellPhone, setUserCellPhone] = useState("");
+    const [userCellPhone, setUserCellPhone] = useState("Stryker was here!");
     const handleClose = () => setShow(false);
     const handleShow = () => setShow(true);

[Survived] ArrowFunction
src/main/pages/ProfilePage.js:13:25
 
     const [showModal, setShow] = useState(false);
     const [userCellPhone, setUserCellPhone] = useState("");
-    const handleClose = () => setShow(false);
+    const handleClose = () => undefined;
     const handleShow = () => setShow(true);
     const onSubmit = (event) => {

[Survived] BooleanLiteral
src/main/pages/ProfilePage.js:13:39
 
     const [showModal, setShow] = useState(false);
     const [userCellPhone, setUserCellPhone] = useState("");
-    const handleClose = () => setShow(false);
+    const handleClose = () => setShow(true);
     const handleShow = () => setShow(true);
     const onSubmit = (event) => {

[Survived] ArrowFunction
src/main/pages/ProfilePage.js:14:24
     const [showModal, setShow] = useState(false);
     const [userCellPhone, setUserCellPhone] = useState("");
     const handleClose = () => setShow(false);
-    const handleShow = () => setShow(true);
+    const handleShow = () => undefined;
     const onSubmit = (event) => {
         const response = axios.put(`/api/userprofile?cellPhone=${userCellPhone}`)

[Survived] BooleanLiteral
src/main/pages/ProfilePage.js:14:38
     const [showModal, setShow] = useState(false);
     const [userCellPhone, setUserCellPhone] = useState("");
     const handleClose = () => setShow(false);
-    const handleShow = () => setShow(true);
+    const handleShow = () => setShow(false);
     const onSubmit = (event) => {
         const response = axios.put(`/api/userprofile?cellPhone=${userCellPhone}`)

[Survived] BlockStatement
src/main/pages/ProfilePage.js:15:33
     const [userCellPhone, setUserCellPhone] = useState("");
     const handleClose = () => setShow(false);
     const handleShow = () => setShow(true);
-    const onSubmit = (event) => {
-        const response = axios.put(`/api/userprofile?cellPhone=${userCellPhone}`)
-        console.log("updated phone number at "+response);
-        event.preventDefault();
-        console.log(userCellPhone);
-        window.location.reload();
-    }
+    const onSubmit = (event) => {}
 
     const { data: currentUser } = useCurrentUser();

[Survived] ArrowFunction
src/main/pages/ProfilePage.js:65:111
                             </Modal.Header>
                             <Modal.Body>Enter New Phone Number</Modal.Body>
                             <form onSubmit={onSubmit}>
-                                <input type="tel" placeholder="Enter New Phone Number" name="phone" onChange={(e) => setUserCellPhone(e.target.value)}></input>
+                                <input type="tel" placeholder="Enter New Phone Number" name="phone" onChange={() => undefined}></input>
                             <Modal.Footer>
                                 <Button type="submit">Update</Button>
