[Killed] StringLiteral
main/components/Ride/RideTable.js:165:23
         },
         {
             Header: 'Drop Off',
-            accessor: 'dropoffLocation',
+            accessor: "",
         },
         {
killedBy: RideTable tests Has the expected column headers and content for ordinary rider
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-dropoffLocation"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
