[Killed] BlockStatement
main/components/Nav/AppNavbar.js:7:37
 import headerImg from "../../../assets/stork.png"
 import AppNavbarLocalhost from "main/components/Nav/AppNavbarLocalhost"
 
-function isParticipant(currentUser) {
-  return (
-    hasRole(currentUser, "ROLE_ADMIN")
-    || hasRole(currentUser, "ROLE_DRIVER")
-    || hasRole(currentUser, "ROLE_RIDER")
-  );
-}
+function isParticipant(currentUser) {}
 
 export default function AppNavbar({ currentUser, systemInfo, doLogout, currentUrl = window.location.href }) {
killedBy: AppNavbar tests renders shift table links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-shift-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:9:5
 
 function isParticipant(currentUser) {
   return (
-    hasRole(currentUser, "ROLE_ADMIN")
-    || hasRole(currentUser, "ROLE_DRIVER")
-    || hasRole(currentUser, "ROLE_RIDER")
+    false
   );
 }
killedBy: AppNavbar tests renders shift table links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-shift-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:9:5
 
 function isParticipant(currentUser) {
   return (
-    hasRole(currentUser, "ROLE_ADMIN")
-    || hasRole(currentUser, "ROLE_DRIVER")
+    false
     || hasRole(currentUser, "ROLE_RIDER")
   );
killedBy: AppNavbar tests renders shift table links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-shift-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:25:9
   return (
     <>
       {
-        (currentUrl.startsWith("http://localhost:3000") || currentUrl.startsWith("http://127.0.0.1:3000")) && (
-          <AppNavbarLocalhost url={currentUrl} />
-        )
+        currentUrl.startsWith("http://localhost:3000") || currentUrl.startsWith("http://127.0.0.1:3000") || <AppNavbarLocalhost url={currentUrl} />
       }
 
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Error: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] MethodExpression
main/components/Nav/AppNavbar.js:25:60
   return (
     <>
       {
-        (currentUrl.startsWith("http://localhost:3000") || currentUrl.startsWith("http://127.0.0.1:3000")) && (
+        (currentUrl.startsWith("http://localhost:3000") || currentUrl.endsWith("http://127.0.0.1:3000")) && (
           <AppNavbarLocalhost url={currentUrl} />
         )
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://127.0.0.1:3000
statusReason: Error: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ObjectLiteral
main/components/Nav/AppNavbar.js:32:78
 
       <Navbar expand="xl" variant="dark" sticky="top" data-testid="AppNavbar" style={styles.navbar}>
         <Container>
-        <img data-testid="gauchoride-nav-logo" src={headerImg} alt="" style={{width: 80, height: 80, marginRight: 15}} />
+        <img data-testid="gauchoride-nav-logo" src={headerImg} alt="" style={{}} />
 
           <Navbar.Brand as={Link} to="/">
killedBy: AppNavbar tests renders image correctly
statusReason: Error: expect(element).toHaveAttribute("style", "width: 80px; height: 80px; margin-right: 15px;") // element.getAttribute("style") === "width: 80px; height: 80px; margin-right: 15px;"

Expected the element to have attribute:
  style="width: 80px; height: 80px; margin-right: 15px;"
Received:
  null

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:48:17
             {/* This `nav` component contains all navigation items that show up on the left side */}
             <Nav className="me-auto" >
               {
-                systemInfo?.springH2ConsoleEnabled && (
-                  <>
-                    <Nav.Link href="/h2-console">H2Console</Nav.Link>
-                  </>
-                )
+                systemInfo?.springH2ConsoleEnabled || <>
+                    <Nav.Link href="/h2-console">H2Console</Nav.Link>
+                  </>
               }
               {
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: Error: Unable to find an element with the text: H2Console. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:62:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown" >
-                    <NavDropdown.Item as={Link} to="/admin/users">Users</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown">
+                    <NavDropdown.Item as={Link} to="/admin/users">Users</NavDropdown.Item>
+                  </NavDropdown>
               }
               {
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="nav-item dropdown" data-testid="appnavbar-admin-dropdown"><a aria-expanded="false" class="dropdown-toggle nav-link" href="#" id="appnavbar-admin-dropdown" role="button" tabindex="0">Admin</a></div> instead

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:62:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown" >
-                    <NavDropdown.Item as={Link} to="/admin/users">Users</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                false
               }
               {
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:69:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <NavDropdown title="Shift" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
-                    <NavDropdown.Item as={Link} to="/shift/list">Driver shift table</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                isParticipant(currentUser) || <NavDropdown title="Shift" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown">
+                    <NavDropdown.Item as={Link} to="/shift/list">Driver shift table</NavDropdown.Item>
+                  </NavDropdown>
               }
               {
killedBy: AppNavbar tests renders shift table links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-shift-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:69:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <NavDropdown title="Shift" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
-                    <NavDropdown.Item as={Link} to="/shift/list">Driver shift table</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                false
               }
               {
killedBy: AppNavbar tests renders shift table links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-shift-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:76:17
                 )
               }
               {
-                ((hasRole(currentUser, "ROLE_RIDER") || hasRole(currentUser, "ROLE_ADMIN"))) && (
-                  <Nav.Link id="appnavbar-rider-dashboard" data-testid="appnavbar-rider-dashboard" href="/rider/">Rider</Nav.Link>
-                )
+                false
               }
             </Nav>
killedBy: AppNavbar tests renders ride links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-rider-dashboard"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:76:19
                 )
               }
               {
-                ((hasRole(currentUser, "ROLE_RIDER") || hasRole(currentUser, "ROLE_ADMIN"))) && (
+                ((hasRole(currentUser, "ROLE_RIDER") && hasRole(currentUser, "ROLE_ADMIN"))) && (
                   <Nav.Link id="appnavbar-rider-dashboard" data-testid="appnavbar-rider-dashboard" href="/rider/">Rider</Nav.Link>
                 )
killedBy: AppNavbar tests renders ride links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-rider-dashboard"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"
