[Killed] ObjectLiteral
main/components/Ride/RideTable.js:149:9
             Header: 'Drop Off',
             accessor: 'dropoffLocation',
         },
-        {
-            Header: 'Drop Off Room',
-            accessor: 'dropoffRoom',
-        }
+        {}
 
     ];
killedBy: RideTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!
