[Killed] BlockStatement
src/main/pages/ProfilePage.js:15:33
     const [userCellPhone, setUserCellPhone] = useState("");
     // Stryker restore all
 
-    const onSubmit = (event) => {
-        const newPhoneNumber= event.target;
-        console.log(newPhoneNumber);
-        axios.put(`/api/userprofile?cellPhone=${userCellPhone}`)
-        event.preventDefault();
-        // console.log(userCellPhone);
-        window.location.reload();
-    }
+    const onSubmit = (event) => {}
     
 
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
src/main/pages/ProfilePage.js:66:38
                             Update Phone Number
                     </Button>
                     </div>
-                    <RoleBadge role={"ROLE_USER"} currentUser={currentUser}/>
+                    <RoleBadge role={""} currentUser={currentUser}/>
                     <RoleBadge role={"ROLE_MEMBER"} currentUser={currentUser}/>
                     <RoleBadge role={"ROLE_ADMIN"} currentUser={currentUser}/>
killedBy: ProfilePage tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="role-badge-user"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div
