[Killed] StringLiteral
main/components/RideRequest/RideRequestForm.js:6:88
 import { useForm } from 'react-hook-form'
 import { useNavigate } from 'react-router-dom';
 
-export default function RideRequestForm({ initialContents, submitAction, buttonLabel = "Create" }) {
+export default function RideRequestForm({ initialContents, submitAction, buttonLabel = "" }) {
     const navigate = useNavigate();
     
killedBy: RideRequestForm tests renders correctly with no initialContents
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
