[Killed] BlockStatement
main/components/RideRequest/RideRequestTable.js:12:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/ride-request/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: RideRequestTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ride-request/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:13:18
     const navigate = useNavigate();
 
     const editCallback = (cell) => {
-        navigate(`/ride-request/edit/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: RideRequestTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ride-request/edit/2"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:30:19
 
 
     const columnsAdmin = [
-        { Header: 'id', accessor: 'id' },
+        { Header: "", accessor: 'id' },
         { Header: 'Day', accessor: 'day' },
         { Header: 'Student', accessor: 'student' },
killedBy: RideRequestTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:31:36
 
     const columnsAdmin = [
         { Header: 'id', accessor: 'id' },
-        { Header: 'Day', accessor: 'day' },
+        { Header: 'Day', accessor: "" },
         { Header: 'Student', accessor: 'student' },
         { Header: 'Driver', accessor: 'driver' },
killedBy: RideRequestTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideRequestTable-cell-row-0-col-day"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:32:40
     const columnsAdmin = [
         { Header: 'id', accessor: 'id' },
         { Header: 'Day', accessor: 'day' },
-        { Header: 'Student', accessor: 'student' },
+        { Header: 'Student', accessor: "" },
         { Header: 'Driver', accessor: 'driver' },
         { Header: 'Start Time', accessor: 'startTime' },
killedBy: RideRequestTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideRequestTable-cell-row-0-col-student"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:33:39
         { Header: 'id', accessor: 'id' },
         { Header: 'Day', accessor: 'day' },
         { Header: 'Student', accessor: 'student' },
-        { Header: 'Driver', accessor: 'driver' },
+        { Header: 'Driver', accessor: "" },
         { Header: 'Start Time', accessor: 'startTime' },
         { Header: 'End Time', accessor: 'endTime' },
killedBy: RideRequestTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideRequestTable-cell-row-0-col-driver"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:34:19
         { Header: 'Day', accessor: 'day' },
         { Header: 'Student', accessor: 'student' },
         { Header: 'Driver', accessor: 'driver' },
-        { Header: 'Start Time', accessor: 'startTime' },
+        { Header: "", accessor: 'startTime' },
         { Header: 'End Time', accessor: 'endTime' },
         { Header: 'Pick-up Location', accessor: 'pickupLocation' },
killedBy: RideRequestTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Start Time. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:34:43
         { Header: 'Day', accessor: 'day' },
         { Header: 'Student', accessor: 'student' },
         { Header: 'Driver', accessor: 'driver' },
-        { Header: 'Start Time', accessor: 'startTime' },
+        { Header: 'Start Time', accessor: "" },
         { Header: 'End Time', accessor: 'endTime' },
         { Header: 'Pick-up Location', accessor: 'pickupLocation' },
killedBy: RideRequestTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideRequestTable-cell-row-0-col-startTime"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:35:19
         { Header: 'Student', accessor: 'student' },
         { Header: 'Driver', accessor: 'driver' },
         { Header: 'Start Time', accessor: 'startTime' },
-        { Header: 'End Time', accessor: 'endTime' },
+        { Header: "", accessor: 'endTime' },
         { Header: 'Pick-up Location', accessor: 'pickupLocation' },
         { Header: 'Pick-up Room #', accessor: 'pickupRoom' },
killedBy: RideRequestTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: End Time. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:35:41
         { Header: 'Student', accessor: 'student' },
         { Header: 'Driver', accessor: 'driver' },
         { Header: 'Start Time', accessor: 'startTime' },
-        { Header: 'End Time', accessor: 'endTime' },
+        { Header: 'End Time', accessor: "" },
         { Header: 'Pick-up Location', accessor: 'pickupLocation' },
         { Header: 'Pick-up Room #', accessor: 'pickupRoom' },
killedBy: RideRequestTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideRequestTable-cell-row-0-col-endTime"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:37:47
         { Header: 'Start Time', accessor: 'startTime' },
         { Header: 'End Time', accessor: 'endTime' },
         { Header: 'Pick-up Location', accessor: 'pickupLocation' },
-        { Header: 'Pick-up Room #', accessor: 'pickupRoom' },
+        { Header: 'Pick-up Room #', accessor: "" },
         { Header: 'Drop-off Location', accessor: 'dropoffLocation' },
         { Header: 'Drop-off Room #', accessor: 'dropoffRoom' },
killedBy: RideRequestTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideRequestTable-cell-row-0-col-pickupRoom"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:38:19
         { Header: 'End Time', accessor: 'endTime' },
         { Header: 'Pick-up Location', accessor: 'pickupLocation' },
         { Header: 'Pick-up Room #', accessor: 'pickupRoom' },
-        { Header: 'Drop-off Location', accessor: 'dropoffLocation' },
+        { Header: "", accessor: 'dropoffLocation' },
         { Header: 'Drop-off Room #', accessor: 'dropoffRoom' },
         { Header: 'Course',  accessor: 'course' },
killedBy: RideRequestTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Drop-off Location. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/RideRequest/RideRequestTable.js:39:9
         { Header: 'Pick-up Location', accessor: 'pickupLocation' },
         { Header: 'Pick-up Room #', accessor: 'pickupRoom' },
         { Header: 'Drop-off Location', accessor: 'dropoffLocation' },
-        { Header: 'Drop-off Room #', accessor: 'dropoffRoom' },
+        {},
         { Header: 'Course',  accessor: 'course' },
         { Header: 'Notes',  accessor: 'notes' },
killedBy: RideRequestTable tests renders without crashing for empty table for admin
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/RideRequest/RideRequestTable.js:41:9
         { Header: 'Drop-off Location', accessor: 'dropoffLocation' },
         { Header: 'Drop-off Room #', accessor: 'dropoffRoom' },
         { Header: 'Course',  accessor: 'course' },
-        { Header: 'Notes',  accessor: 'notes' },
+        {},
         ButtonColumn("Edit", "primary", editCallback, "RideRequestTable"),
         ButtonColumn("Delete", "danger", deleteCallback, "RideRequestTable")
killedBy: RideRequestTable tests renders without crashing for empty table for admin
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:42:22
         { Header: 'Drop-off Room #', accessor: 'dropoffRoom' },
         { Header: 'Course',  accessor: 'course' },
         { Header: 'Notes',  accessor: 'notes' },
-        ButtonColumn("Edit", "primary", editCallback, "RideRequestTable"),
+        ButtonColumn("", "primary", editCallback, "RideRequestTable"),
         ButtonColumn("Delete", "danger", deleteCallback, "RideRequestTable")
     ];
killedBy: RideRequestTable tests renders without crashing for empty table for admin
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:42:55
         { Header: 'Drop-off Room #', accessor: 'dropoffRoom' },
         { Header: 'Course',  accessor: 'course' },
         { Header: 'Notes',  accessor: 'notes' },
-        ButtonColumn("Edit", "primary", editCallback, "RideRequestTable"),
+        ButtonColumn("Edit", "primary", editCallback, ""),
         ButtonColumn("Delete", "danger", deleteCallback, "RideRequestTable")
     ];
killedBy: RideRequestTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideRequestTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:43:32
         { Header: 'Course',  accessor: 'course' },
         { Header: 'Notes',  accessor: 'notes' },
         ButtonColumn("Edit", "primary", editCallback, "RideRequestTable"),
-        ButtonColumn("Delete", "danger", deleteCallback, "RideRequestTable")
+        ButtonColumn("Delete", "", deleteCallback, "RideRequestTable")
     ];
 
killedBy: RideRequestTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn

[Killed] ArrayDeclaration
main/components/RideRequest/RideRequestTable.js:46:27
         ButtonColumn("Delete", "danger", deleteCallback, "RideRequestTable")
     ];
 
-    const columnsDriver = [
-        { Header: 'id', accessor: 'id' },
-        { Header: 'Day', accessor: 'day' },
-        { Header: 'Student', accessor: 'student' },
-        { Header: 'Start Time', accessor: 'startTime' },
-        { Header: 'End Time', accessor: 'endTime' },
-        { Header: 'Pick-up Location', accessor: 'pickupLocation' },
-        { Header: 'Pick-up Room #', accessor: 'pickupRoom' },
-        { Header: 'Drop-off Location', accessor: 'dropoffLocation' },
-        { Header: 'Drop-off Room #', accessor: 'dropoffRoom' },
-        { Header: 'Course',  accessor: 'course' },
-        { Header: 'Notes',  accessor: 'notes' },
-    ];
+    const columnsDriver = [];
 
     const columnsRider = [
killedBy: RideRequestTable tests Has the expected column headers and content for driver
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:47:19
     ];
 
     const columnsDriver = [
-        { Header: 'id', accessor: 'id' },
+        { Header: "", accessor: 'id' },
         { Header: 'Day', accessor: 'day' },
         { Header: 'Student', accessor: 'student' },
killedBy: RideRequestTable tests Has the expected column headers and content for driver
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/RideRequest/RideRequestTable.js:49:9
     const columnsDriver = [
         { Header: 'id', accessor: 'id' },
         { Header: 'Day', accessor: 'day' },
-        { Header: 'Student', accessor: 'student' },
+        {},
         { Header: 'Start Time', accessor: 'startTime' },
         { Header: 'End Time', accessor: 'endTime' },
killedBy: RideRequestTable tests renders without crashing for empty table for driver
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:50:43
         { Header: 'id', accessor: 'id' },
         { Header: 'Day', accessor: 'day' },
         { Header: 'Student', accessor: 'student' },
-        { Header: 'Start Time', accessor: 'startTime' },
+        { Header: 'Start Time', accessor: "" },
         { Header: 'End Time', accessor: 'endTime' },
         { Header: 'Pick-up Location', accessor: 'pickupLocation' },
killedBy: RideRequestTable tests Has the expected column headers and content for driver
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideRequestTable-cell-row-0-col-startTime"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/RideRequest/RideRequestTable.js:51:9
         { Header: 'Day', accessor: 'day' },
         { Header: 'Student', accessor: 'student' },
         { Header: 'Start Time', accessor: 'startTime' },
-        { Header: 'End Time', accessor: 'endTime' },
+        {},
         { Header: 'Pick-up Location', accessor: 'pickupLocation' },
         { Header: 'Pick-up Room #', accessor: 'pickupRoom' },
killedBy: RideRequestTable tests renders without crashing for empty table for driver
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:52:49
         { Header: 'Student', accessor: 'student' },
         { Header: 'Start Time', accessor: 'startTime' },
         { Header: 'End Time', accessor: 'endTime' },
-        { Header: 'Pick-up Location', accessor: 'pickupLocation' },
+        { Header: 'Pick-up Location', accessor: "" },
         { Header: 'Pick-up Room #', accessor: 'pickupRoom' },
         { Header: 'Drop-off Location', accessor: 'dropoffLocation' },
killedBy: RideRequestTable tests Has the expected column headers and content for driver
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideRequestTable-cell-row-0-col-pickupLocation"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/RideRequest/RideRequestTable.js:52:9
         { Header: 'Student', accessor: 'student' },
         { Header: 'Start Time', accessor: 'startTime' },
         { Header: 'End Time', accessor: 'endTime' },
-        { Header: 'Pick-up Location', accessor: 'pickupLocation' },
+        {},
         { Header: 'Pick-up Room #', accessor: 'pickupRoom' },
         { Header: 'Drop-off Location', accessor: 'dropoffLocation' },
killedBy: RideRequestTable tests renders without crashing for empty table for driver
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:53:19
         { Header: 'Start Time', accessor: 'startTime' },
         { Header: 'End Time', accessor: 'endTime' },
         { Header: 'Pick-up Location', accessor: 'pickupLocation' },
-        { Header: 'Pick-up Room #', accessor: 'pickupRoom' },
+        { Header: "", accessor: 'pickupRoom' },
         { Header: 'Drop-off Location', accessor: 'dropoffLocation' },
         { Header: 'Drop-off Room #', accessor: 'dropoffRoom' },
killedBy: RideRequestTable tests Has the expected column headers and content for driver
statusReason: TestingLibraryElementError: Unable to find an element with the text: Pick-up Room #. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/RideRequest/RideRequestTable.js:53:9
         { Header: 'Start Time', accessor: 'startTime' },
         { Header: 'End Time', accessor: 'endTime' },
         { Header: 'Pick-up Location', accessor: 'pickupLocation' },
-        { Header: 'Pick-up Room #', accessor: 'pickupRoom' },
+        {},
         { Header: 'Drop-off Location', accessor: 'dropoffLocation' },
         { Header: 'Drop-off Room #', accessor: 'dropoffRoom' },
killedBy: RideRequestTable tests renders without crashing for empty table for driver
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:56:19
         { Header: 'Pick-up Room #', accessor: 'pickupRoom' },
         { Header: 'Drop-off Location', accessor: 'dropoffLocation' },
         { Header: 'Drop-off Room #', accessor: 'dropoffRoom' },
-        { Header: 'Course',  accessor: 'course' },
+        { Header: "",  accessor: 'course' },
         { Header: 'Notes',  accessor: 'notes' },
     ];
killedBy: RideRequestTable tests Has the expected column headers and content for driver
statusReason: TestingLibraryElementError: Unable to find an element with the text: Course. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:56:40
         { Header: 'Pick-up Room #', accessor: 'pickupRoom' },
         { Header: 'Drop-off Location', accessor: 'dropoffLocation' },
         { Header: 'Drop-off Room #', accessor: 'dropoffRoom' },
-        { Header: 'Course',  accessor: 'course' },
+        { Header: 'Course',  accessor: "" },
         { Header: 'Notes',  accessor: 'notes' },
     ];
killedBy: RideRequestTable tests Has the expected column headers and content for driver
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideRequestTable-cell-row-0-col-course"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:61:35
     ];
 
     const columnsRider = [
-        { Header: 'id', accessor: 'id' },
+        { Header: 'id', accessor: "" },
         { Header: 'Day', accessor: 'day' },
         { Header: 'Driver', accessor: 'driver' },
killedBy: RiderPage tests renders three rides without crashing for rider
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  2
Received:


<html>

[Survived] StringLiteral
main/components/RideRequest/RideRequestTable.js:61:19
     ];
 
     const columnsRider = [
-        { Header: 'id', accessor: 'id' },
+        { Header: "", accessor: 'id' },
         { Header: 'Day', accessor: 'day' },
         { Header: 'Driver', accessor: 'driver' },

[Killed] ObjectLiteral
main/components/RideRequest/RideRequestTable.js:63:9
     const columnsRider = [
         { Header: 'id', accessor: 'id' },
         { Header: 'Day', accessor: 'day' },
-        { Header: 'Driver', accessor: 'driver' },
+        {},
         { Header: 'Start Time', accessor: 'startTime' },
         { Header: 'End Time', accessor: 'endTime' },
killedBy: RiderPage tests renders three rides without crashing for rider
statusReason: Error: A column ID (or string accessor) is required!

[Survived] StringLiteral
main/components/RideRequest/RideRequestTable.js:63:39
     const columnsRider = [
         { Header: 'id', accessor: 'id' },
         { Header: 'Day', accessor: 'day' },
-        { Header: 'Driver', accessor: 'driver' },
+        { Header: 'Driver', accessor: "" },
         { Header: 'Start Time', accessor: 'startTime' },
         { Header: 'End Time', accessor: 'endTime' },

[Killed] ObjectLiteral
main/components/RideRequest/RideRequestTable.js:68:9
         { Header: 'End Time', accessor: 'endTime' },
         { Header: 'Pick-up Location', accessor: 'pickupLocation' },
         { Header: 'Pick-up Room #', accessor: 'pickupRoom' },
-        { Header: 'Drop-off Location', accessor: 'dropoffLocation' },
+        {},
         { Header: 'Drop-off Room #', accessor: 'dropoffRoom' },
         { Header: 'Course',  accessor: 'course' },
killedBy: RideRequestTable tests Edit button navigates to the edit page for rider
statusReason: Error: A column ID (or string accessor) is required!

[Survived] StringLiteral
main/components/RideRequest/RideRequestTable.js:69:19
         { Header: 'Pick-up Location', accessor: 'pickupLocation' },
         { Header: 'Pick-up Room #', accessor: 'pickupRoom' },
         { Header: 'Drop-off Location', accessor: 'dropoffLocation' },
-        { Header: 'Drop-off Room #', accessor: 'dropoffRoom' },
+        { Header: "", accessor: 'dropoffRoom' },
         { Header: 'Course',  accessor: 'course' },
         { Header: 'Notes',  accessor: 'notes' },

[Killed] ObjectLiteral
main/components/RideRequest/RideRequestTable.js:77:9
     ];
 
     const columnsUser = [
-        { Header: 'id', accessor: 'id' },
+        {},
         { Header: 'Day', accessor: 'day' },
         { Header: 'Student', accessor: 'student' },
killedBy: RiderPage tests renders without crashing for regular user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/RideRequest/RideRequestTable.js:80:9
         { Header: 'id', accessor: 'id' },
         { Header: 'Day', accessor: 'day' },
         { Header: 'Student', accessor: 'student' },
-        { Header: 'Driver', accessor: 'driver' },
+        {},
         { Header: 'Start Time', accessor: 'startTime' },
         { Header: 'End Time', accessor: 'endTime' },
killedBy: RideRequestTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/RideRequest/RideRequestTable.js:81:9
         { Header: 'Day', accessor: 'day' },
         { Header: 'Student', accessor: 'student' },
         { Header: 'Driver', accessor: 'driver' },
-        { Header: 'Start Time', accessor: 'startTime' },
+        {},
         { Header: 'End Time', accessor: 'endTime' },
         { Header: 'Pick-up Location', accessor: 'pickupLocation' },
killedBy: RideRequestTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/RideRequest/RideRequestTable.js:87:9
         { Header: 'Pick-up Room #', accessor: 'pickupRoom' },
         { Header: 'Drop-off Location', accessor: 'dropoffLocation' },
         { Header: 'Drop-off Room #', accessor: 'dropoffRoom' },
-        { Header: 'Course',  accessor: 'course' },
+        {},
         { Header: 'Notes',  accessor: 'notes' }
     ];
killedBy: RideRequestTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:88:39
         { Header: 'Drop-off Location', accessor: 'dropoffLocation' },
         { Header: 'Drop-off Room #', accessor: 'dropoffRoom' },
         { Header: 'Course',  accessor: 'course' },
-        { Header: 'Notes',  accessor: 'notes' }
+        { Header: 'Notes',  accessor: "" }
     ];
    
killedBy: RideRequestTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideRequestTable-cell-row-0-col-notes"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:88:19
         { Header: 'Drop-off Location', accessor: 'dropoffLocation' },
         { Header: 'Drop-off Room #', accessor: 'dropoffRoom' },
         { Header: 'Course',  accessor: 'course' },
-        { Header: 'Notes',  accessor: 'notes' }
+        { Header: "",  accessor: 'notes' }
     ];
    
killedBy: RideRequestTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Notes. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RideRequest/RideRequestTable.js:93:51
    
     const columnsToDisplay = hasRole(currentUser, "ROLE_ADMIN") ? columnsAdmin :
                              hasRole(currentUser, "ROLE_DRIVER") ? columnsDriver :
-                             hasRole(currentUser, "ROLE_RIDER") ? columnsRider : columnsUser;
+                             hasRole(currentUser, "") ? columnsRider : columnsUser;
     
     return <OurTable
killedBy: RideRequestTable tests Edit button navigates to the edit page for rider
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideRequestTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
