[Killed] ArrowFunction
main/pages/RideRequest/RideRequestCreatePage.js:10:33
 
 export default function RideRequestCreatePage() {
 
-    const objectToAxiosParams = (rideReq) => ({
-        url: "/api/ride_request/post",
-        method: "POST",
-        params: removeId(rideReq)
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (rideReq) => {
killedBy: RideRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/RideRequest/RideRequestCreatePage.js:16:36
         params: removeId(rideReq)
     });
 
-    const onSuccess = (rideReq) => {
-        toast(`Ride Request Created - id: ${rideReq.id}`);
-    }
+    const onSuccess = (rideReq) => {}
 
     const mutation = useBackendMutation(
killedBy: RideRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Ride Request Created - id: 17"

Number of calls: 0

[Killed] BlockStatement
main/pages/RideRequest/RideRequestCreatePage.js:33:20
         mutation.mutate(data);
     }
 
-    if (isSuccess) {
-        return <Navigate to="/rider" />
-    }
+    if (isSuccess) {}
 
     return (
killedBy: RideRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/rider"}

Number of calls: 0
