[Killed] ObjectLiteral
main/pages/RideRequest/RideRequestEditPage.js:20:17
       {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
         url: `/api/ride_request`,
-        params: {
-          id
-        }
+        params: {}
       }
     );
killedBy: RideRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideRequestForm-day"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/RideRequest/RideRequestEditPage.js:27:34
     );
 
 
-  const objectToAxiosPutParams = (rideReq) => ({
-    url: "/api/ride_request",
-    method: "PUT",
-    params: {
-      id: rideReq.id,
-    },
-    data: removeId(rideReq)
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (rideReq) => {
killedBy: RideRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/RideRequest/RideRequestEditPage.js:27:48
     );
 
 
-  const objectToAxiosPutParams = (rideReq) => ({
-    url: "/api/ride_request",
-    method: "PUT",
-    params: {
-      id: rideReq.id,
-    },
-    data: removeId(rideReq)
-  });
+  const objectToAxiosPutParams = (rideReq) => ({});
 
   const onSuccess = (rideReq) => {
killedBy: RideRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/RideRequest/RideRequestEditPage.js:29:13
 
   const objectToAxiosPutParams = (rideReq) => ({
     url: "/api/ride_request",
-    method: "PUT",
+    method: "",
     params: {
       id: rideReq.id,
killedBy: RideRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ObjectLiteral
main/pages/RideRequest/RideRequestEditPage.js:30:13
   const objectToAxiosPutParams = (rideReq) => ({
     url: "/api/ride_request",
     method: "PUT",
-    params: {
-      id: rideReq.id,
-    },
+    params: {},
     data: removeId(rideReq)
   });
killedBy: RideRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "id": 17,
- }

[Killed] BlockStatement
main/pages/RideRequest/RideRequestEditPage.js:36:34
     data: removeId(rideReq)
   });
 
-  const onSuccess = (rideReq) => {
-    toast(`Ride Request Updated - id: ${rideReq.id}`);
-  }
+  const onSuccess = (rideReq) => {}
 
   const mutation = useBackendMutation(
killedBy: RideRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/RideRequest/RideRequestEditPage.js:37:11
   });
 
   const onSuccess = (rideReq) => {
-    toast(`Ride Request Updated - id: ${rideReq.id}`);
+    toast(``);
   }
 
killedBy: RideRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Ride Request Updated - id: 17"
Received: ""

Number of calls: 1

[Killed] ConditionalExpression
main/pages/RideRequest/RideRequestEditPage.js:61:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Ride Request</h1>
-                {rideReq &&
-                  <RideRequestForm initialContents={rideReq} submitAction={onSubmit} buttonLabel="Update" />
+                {true
                 }
             </div>
killedBy: RideRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideRequestForm-day"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/RideRequest/RideRequestEditPage.js:61:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Ride Request</h1>
-                {rideReq &&
-                  <RideRequestForm initialContents={rideReq} submitAction={onSubmit} buttonLabel="Update" />
+                {rideReq || <RideRequestForm initialContents={rideReq} submitAction={onSubmit} buttonLabel="Update" />
                 }
             </div>
killedBy: RideRequestEditPage tests when the backend doesn't return a todo renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()
