[Killed] BlockStatement
main/pages/RideRequest/RideRequestIndexPage.js:8:48
 import RideRequestTable from 'main/components/RideRequest/RideRequestTable';
 import {useCurrentUser } from 'main/utils/currentUser'
 
-export default function RideRequestIndexPage() {
-
-  const currentUser = useCurrentUser();
-
-  const { data: rideReqs, error: _error, status: _status } =
-  useBackend(
-    // Stryker disable all : hard to test for query caching
-    ["/api/ride_request/all"],
-    { method: "GET", url: "/api/ride_request/all" },
-    []
-    // Stryker restore all 
-  );
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Ride Requests</h1>
-        <RideRequestTable rideReqs={rideReqs} currentUser={currentUser} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function RideRequestIndexPage() {}
killedBy: RideRequestIndexPage tests renders without crashing for regular user
statusReason: Error: RideRequestIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
