[Killed] BlockStatement
src/main/pages/RiderPage.js:10:37
 import Button from 'react-bootstrap/Button';
 import { Link } from 'react-router-dom';
 
-export default function RiderPage() {
-
-  const currentUser = useCurrentUser();
-
-  const { data: rideReqs, error: _error, status: _status } =
-  useBackend(
-    // Stryker disable all : hard to test for query caching
-    ["/api/ride_request/all"],
-    { method: "GET", url: "/api/ride_request/all" },
-    []
-    // Stryker restore all 
-  );
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <Button style={{ float: "right" }} as={Link} to="/ride-request/create">
-          Request a Ride
-        </Button>
-        <h1>Ride Requests</h1>
-        <RideRequestTable rideReqs={rideReqs} currentUser={currentUser} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function RiderPage() {}
killedBy: RiderPage tests renders without crashing for regular user
statusReason: Error: RiderPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
