[Killed] StringLiteral
src/main/utils/rideRequestUtils.js:10:14
 
 export function cellToAxiosParamsDelete(cell) {
     return {
-        url: "/api/ride_request",
+        url: "",
         method: "DELETE",
         params: {
killedBy: RideRequestUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "method": "DELETE",
    "params": Object {

[Killed] BlockStatement
src/main/utils/rideRequestUtils.js:18:35
     }
 }
 
-export function removeId(rideReq) {
-    return {
-        day: rideReq.day,
-        startTime: rideReq.startTime,
-        endTime: rideReq.endTime,
-        pickupLocation: rideReq.pickupLocation,
-        pickupRoom: rideReq.pickupRoom,
-        dropoffLocation: rideReq.dropoffLocation,
-        dropoffRoom: rideReq.dropoffRoom,
-        course: rideReq.course,
-        notes: rideReq.notes
-    };
-}
+export function removeId(rideReq) {}
killedBy: RideRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"day\":\"Tuesday\",\"startTime\":\"5:30 PM\",\"endTime\":\"6:30 PM\",\"pickupLocation\":\"HSSB\",\"pickupRoom\":\"2224\",\"dropoffLocation\":\"SRB\",\"dropoffRoom\":\"1214\",\"course\":\"CMPSC 156\",\"notes\":\"bye :(\"}"
Received: undefined

[Killed] ObjectLiteral
src/main/utils/rideRequestUtils.js:19:12
 }
 
 export function removeId(rideReq) {
-    return {
-        day: rideReq.day,
-        startTime: rideReq.startTime,
-        endTime: rideReq.endTime,
-        pickupLocation: rideReq.pickupLocation,
-        pickupRoom: rideReq.pickupRoom,
-        dropoffLocation: rideReq.dropoffLocation,
-        dropoffRoom: rideReq.dropoffRoom,
-        course: rideReq.course,
-        notes: rideReq.notes
-    };
+    return {};
 }
killedBy: RideRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"day\":\"Tuesday\",\"startTime\":\"5:30 PM\",\"endTime\":\"6:30 PM\",\"pickupLocation\":\"HSSB\",\"pickupRoom\":\"2224\",\"dropoffLocation\":\"SRB\",\"dropoffRoom\":\"1214\",\"course\":\"CMPSC 156\",\"notes\":\"bye :(\"}"
Received: "{}"
