[Killed] StringLiteral
main/components/Rider/RideForm.js:8:66
 
 
 
-function RideForm({ initialContents, submitAction, buttonLabel = "Create" }) {
+function RideForm({ initialContents, submitAction, buttonLabel = "" }) {
     const navigate = useNavigate();
     
killedBy: RideForm tests renders correctly with no initialContents
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
