[Killed] BlockStatement
main/components/Rider/RideTable.js:15:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/rider/ride/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: RideTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/rider/ride/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/Rider/RideTable.js:41:9
             Header: 'Day',
             accessor: 'day',
         },
-        {
-            Header: 'Student',
-            accessor: 'student',
-        },
+        {},
         {
             Header: 'Driver',
killedBy: RideTable tests renders without crashing for empty table for admin
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Rider/RideTable.js:49:9
             Header: 'Driver',
             accessor: 'driver',
         },
-        {
-            Header: 'Course #',
-            accessor: 'course',
-        },
+        {},
         {
             Header: 'Start Time',
killedBy: RideTable tests renders without crashing for empty table for admin
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Rider/RideTable.js:51:23
         },
         {
             Header: 'Course #',
-            accessor: 'course',
+            accessor: "",
         },
         {
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-course"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Rider/RideTable.js:53:9
             Header: 'Course #',
             accessor: 'course',
         },
-        {
-            Header: 'Start Time',
-            accessor: 'startTime',
-        },
+        {},
         {
             Header: 'End Time',
killedBy: RideTable tests renders without crashing for empty table for admin
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Rider/RideTable.js:55:23
         },
         {
             Header: 'Start Time',
-            accessor: 'startTime',
+            accessor: "",
         },
         {
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-startTime"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Rider/RideTable.js:58:21
             accessor: 'startTime',
         },
         {
-            Header: 'End Time',
+            Header: "",
             accessor: 'endTime',
         },
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: End Time. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Rider/RideTable.js:61:9
             Header: 'End Time',
             accessor: 'endTime',
         },
-        {
-            Header: 'Pick Up',
-            accessor: 'pickupLocation',
-        },
+        {},
         {
             Header: 'Drop Off',
killedBy: RideTable tests renders without crashing for empty table for admin
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Rider/RideTable.js:82:23
         },
         {
             Header: 'Day',
-            accessor: 'day',
+            accessor: "",
         },
         {
killedBy: RideTable tests Has the expected column headers and content for ordinary driver
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-day"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Rider/RideTable.js:89:21
             accessor: 'student',
         },
         {
-            Header: 'Course #',
+            Header: "",
             accessor: 'course',
         },
killedBy: RideTable tests Has the expected column headers and content for ordinary driver
statusReason: TestingLibraryElementError: Unable to find an element with the text: Course #. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Rider/RideTable.js:93:21
             accessor: 'course',
         },
         {
-            Header: 'Start Time',
+            Header: "",
             accessor: 'startTime',
         },
killedBy: RideTable tests Has the expected column headers and content for ordinary driver
statusReason: TestingLibraryElementError: Unable to find an element with the text: Start Time. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Rider/RideTable.js:96:9
             Header: 'Start Time',
             accessor: 'startTime',
         },
-        {
-            Header: 'End Time',
-            accessor: 'endTime',
-        },
+        {},
         {
             Header: 'Pick Up',
killedBy: RideTable tests renders without crashing for empty table for driver
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Rider/RideTable.js:98:23
         },
         {
             Header: 'End Time',
-            accessor: 'endTime',
+            accessor: "",
         },
         {
killedBy: RideTable tests Has the expected column headers and content for ordinary driver
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-endTime"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Rider/RideTable.js:102:23
         },
         {
             Header: 'Pick Up',
-            accessor: 'pickupLocation',
+            accessor: "",
         },
         {
killedBy: RideTable tests Has the expected column headers and content for ordinary driver
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-pickupLocation"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Rider/RideTable.js:108:9
             Header: 'Drop Off',
             accessor: 'dropoffLocation',
         },
-        {
-            Header: 'Room #',
-            accessor: 'room',
-        }
+        {}
     ];
 
killedBy: RideTable tests renders without crashing for empty table for driver
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Rider/RideTable.js:110:23
         },
         {
             Header: 'Room #',
-            accessor: 'room',
+            accessor: "",
         }
     ];
killedBy: RideTable tests Has the expected column headers and content for ordinary driver
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-room"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Rider/RideTable.js:119:9
             Header: 'id',
             accessor: 'id', // accessor is the "key" in the data
         },
-        {
-            Header: 'Day',
-            accessor: 'day',
-        },
+        {},
         {
             Header: 'Driver',
killedBy: RideTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Rider/RideTable.js:120:21
             accessor: 'id', // accessor is the "key" in the data
         },
         {
-            Header: 'Day',
+            Header: "",
             accessor: 'day',
         },
killedBy: RideTable tests Has the expected column headers and content for ordinary rider
statusReason: TestingLibraryElementError: Unable to find an element with the text: Day. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Rider/RideTable.js:156:22
 
     const buttonColumnsRider = [
         ...columnsRider,
-        ButtonColumn("Edit", "primary", editCallback, "RideTable"),
+        ButtonColumn("", "primary", editCallback, "RideTable"),
         ButtonColumn("Delete", "danger", deleteCallback, "RideTable")
     ]
killedBy: RideTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Rider/RideTable.js:162:30
 
     const buttonColumnsAdmin = [
         ...columns,
-        ButtonColumn("Edit", "primary", editCallback, "RideTable"),
+        ButtonColumn("Edit", "", editCallback, "RideTable"),
         ButtonColumn("Delete", "danger", deleteCallback, "RideTable")
     ]
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/Rider/RideTable.js:163:22
     const buttonColumnsAdmin = [
         ...columns,
         ButtonColumn("Edit", "primary", editCallback, "RideTable"),
-        ButtonColumn("Delete", "danger", deleteCallback, "RideTable")
+        ButtonColumn("", "danger", deleteCallback, "RideTable")
     ]
 
killedBy: RideTable tests renders without crashing for empty table for admin
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Rider/RideTable.js:167:52
     ]
 
    
-    const columnsToDisplay = (hasRole(currentUser, "ROLE_ADMIN")) ? buttonColumnsAdmin : (hasRole(currentUser, "ROLE_DRIVER")) ? columnsDriver: buttonColumnsRider;
+    const columnsToDisplay = (hasRole(currentUser, "")) ? buttonColumnsAdmin : (hasRole(currentUser, "ROLE_DRIVER")) ? columnsDriver: buttonColumnsRider;
     
     
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Driver. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
