[Killed] BlockStatement
main/components/Users/UsersTable.js:10:49
 export default function UsersTable({ users}) {
 
     //toggleAdmin
-    function cellToAxiosParamsToggleAdmin(cell) {
-        return {
-            url: "/api/admin/users/toggleAdmin",
-            method: "POST",
-            params: {
-                id: cell.row.values.id
-            }
-        }
-    }
+    function cellToAxiosParamsToggleAdmin(cell) {}
 
     // Stryker disable all : hard to test for query caching
killedBy: AdminUsersPage tests usertable toggle admin tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:11:16
 
     //toggleAdmin
     function cellToAxiosParamsToggleAdmin(cell) {
-        return {
-            url: "/api/admin/users/toggleAdmin",
-            method: "POST",
-            params: {
-                id: cell.row.values.id
-            }
-        }
+        return {}
     }
 
killedBy: AdminUsersPage tests usertable toggle admin tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
