[Killed] BlockStatement
src/main/pages/AdminUsersPage.js:6:30
 import UsersTable from "main/components/Users/UsersTable"
 
 import { useBackend } from "main/utils/useBackend";
-const AdminUsersPage = () => {
-
-    const { data: users, error: _error, status: _status } =
-        useBackend(
-            // Stryker disable next-line all : don't test internal caching of React Query
-            ["/api/admin/users"],
-            // Stryker disable next-line StringLiteral,ObjectLiteral : since "GET" is default, "" is an equivalent mutation
-            { method: "GET", url: "/api/admin/users" },
-            []
-        );
-
-    return (
-        <BasicLayout>
-            <h2>Users</h2>
-            <UsersTable users={users} />
-        </BasicLayout>
-    );
-};
+const AdminUsersPage = () => {};
 
 export default AdminUsersPage;
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: Error: AdminUsersPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
