[Killed] ArrowFunction
main/pages/Rider/RideRequestCreatePage.js:9:33
 
 export default function RideRequestCreatePage() {
 
-    const objectToAxiosParams = (ride) => ({
-        url: "/api/ride_request/post",
-        method: "POST",
-        params: {
-            day: ride.day,
-            startTime: ride.start,
-            endTime: ride.end, 
-            pickupLocation: ride.pickup,
-            dropoffLocation: ride.dropoff,
-            room: ride.room,
-            course: ride.course
-        }
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (ride) => {
killedBy: RideRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Rider/RideRequestCreatePage.js:11:17
 
     const objectToAxiosParams = (ride) => ({
         url: "/api/ride_request/post",
-        method: "POST",
+        method: "",
         params: {
             day: ride.day,
killedBy: RideRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Rider/RideRequestCreatePage.js:23:33
         }
     });
 
-    const onSuccess = (ride) => {
-        toast(`New Ride Created - id: ${ride.id}`);
-    }
+    const onSuccess = (ride) => {}
 
     const mutation = useBackendMutation(
killedBy: RideRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Ride Created - id: 17"

Number of calls: 0

[Killed] BlockStatement
main/pages/Rider/RideRequestCreatePage.js:40:20
         mutation.mutate(data);
     }
 
-    if (isSuccess) {
-        return <Navigate to="/rider/" />
-    }
+    if (isSuccess) {}
 
     return (
killedBy: RideRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/rider/"}

Number of calls: 0

[Killed] ConditionalExpression
main/pages/Rider/RideRequestCreatePage.js:40:9
         mutation.mutate(data);
     }
 
-    if (isSuccess) {
+    if (true) {
         return <Navigate to="/rider/" />
     }
killedBy: RideRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: Unable to find an element by: [data-testid="RideForm-day"]

<body>
  <div />
</body>
