[Killed] ObjectLiteral
main/pages/Rider/RideRequestEditPage.js:16:7
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       [`/api/ride_request?id=${id}`],
-      {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-        method: "GET",
-        url: `/api/ride_request`,
-        params: {
-          id
-        }
-      }
+      {}
     );
 
killedBy: RideRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RideForm-day"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/pages/Rider/RideRequestEditPage.js:18:14
       [`/api/ride_request?id=${id}`],
       {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
-        url: `/api/ride_request`,
+        url: ``,
         params: {
           id
killedBy: RideRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RideForm-day"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/Rider/RideRequestEditPage.js:26:34
     );
 
 
-  const objectToAxiosPutParams = (ride) => ({
-    url: "/api/ride_request",
-    method: "PUT",
-    params: {
-      id: ride.id,
-    },
-    data: {
-        day: ride.day,
-        startTime: ride.start,
-        endTime: ride.end, 
-        pickupLocation: ride.pickup,
-        dropoffLocation: ride.dropoff,
-        room: ride.room,
-        course: ride.course
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ride) => {
killedBy: RideRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Rider/RideRequestEditPage.js:43:31
     }
   });
 
-  const onSuccess = (ride) => {
-    toast(`Ride Updated - id: ${ride.id}`);
-  }
+  const onSuccess = (ride) => {}
 
   const mutation = useBackendMutation(
killedBy: RideRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] LogicalOperator
main/pages/Rider/RideRequestEditPage.js:68:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Ride Request</h1>
-                {ride &&
-                <RideForm initialContents={ride} submitAction={onSubmit} buttonLabel="Update" />
+                {ride || <RideForm initialContents={ride} submitAction={onSubmit} buttonLabel="Update" />
                 }
             </div>
killedBy: RideRequestEditPage tests when the backend doesn't return a todo renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

[Killed] ConditionalExpression
main/pages/Rider/RideRequestEditPage.js:68:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Ride Request</h1>
-                {ride &&
-                <RideForm initialContents={ride} submitAction={onSubmit} buttonLabel="Update" />
+                {true
                 }
             </div>
killedBy: RideRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RideForm-day"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
