[Killed] BlockStatement
main/pages/Rider/RideRequestIndexPage.js:10:48
 import Button from 'react-bootstrap/Button';
 import { Link } from 'react-router-dom';
 
-export default function RideRequestIndexPage() {
-
-  const currentUser = useCurrentUser();
-
-  const { data: rides, error: _error, status: _status } =
-  useBackend(
-    // Stryker disable all : hard to test for query caching
-    ["/api/ride_request/all"],
-    { method: "GET", url: "/api/ride_request/all" },
-    []
-    // Stryker restore all 
-  );
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <Button style={{ float: "right" }} as={Link} to="/rider/ride/create">
-          Create Ride Request
-        </Button>
-        <h1>Ride Requests</h1>
-        <RideTable rides={rides} currentUser={currentUser} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function RideRequestIndexPage() {}
killedBy: RideRequestIndexPage tests renders without crashing for regular user
statusReason: Error: RideRequestIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
