[Killed] BlockStatement
src/main/pages/ShiftPage.js:6:25
 import ShiftTable from "main/components/Shift/ShiftTable"
 
 import { useBackend } from "main/utils/useBackend";
-const ShiftPage = () => {
-
-    const { data: shift, error: _error, status: _status } =
-        useBackend(
-            // Stryker disable next-line all : don't test internal caching of React Query
-            ["/api/shift/all"],
-            // Stryker disable next-line StringLiteral,ObjectLiteral : since "GET" is default, "" is an equivalent mutation
-            { method: "GET", url: "/api/shift/all" },
-            []
-        );
-
-    return (
-        <BasicLayout>
-            <h2>Shift</h2>
-            <ShiftTable shift={shift} />
-        </BasicLayout>
-    );
-};
+const ShiftPage = () => {};
 
 export default ShiftPage;
killedBy: ShiftPage tests renders without crashing on three users
statusReason: Error: ShiftPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
