[Killed] BlockStatement
src/main/utils/useBackend.js:28:68
 //     []
 // );
 
-export function useBackend(queryKey, axiosParameters, initialData) {
-
-    return useQuery(queryKey, async () => {
-        try {
-            const response = await axios(axiosParameters);
-            return response.data;
-        } catch (e) {
-            // Stryker disable next-line OptionalChaining
-            if (e.response?.data?.message) {
-                toast.error(e.response.data.message);
-            } else {
-                const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-                toast.error(errorMessage);
-            }
-            throw e;
-        }
-    }, {
-        initialData
-    });
-}
+export function useBackend(queryKey, axiosParameters, initialData) {}
 
 
killedBy: RideRequestIndexPage tests renders without crashing for regular user
statusReason: TypeError: Cannot destructure property 'data' of '(0 , _useBackend.useBackend)(...)' as it is undefined.

[Killed] BlockStatement
src/main/utils/useBackend.js:30:43
 
 export function useBackend(queryKey, axiosParameters, initialData) {
 
-    return useQuery(queryKey, async () => {
-        try {
-            const response = await axios(axiosParameters);
-            return response.data;
-        } catch (e) {
-            // Stryker disable next-line OptionalChaining
-            if (e.response?.data?.message) {
-                toast.error(e.response.data.message);
-            } else {
-                const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-                toast.error(errorMessage);
-            }
-            throw e;
-        }
-    }, {
+    return useQuery(queryKey, async () => {}, {
         initialData
     });
killedBy: RideRequestIndexPage tests renders three rides without crashing for regular user
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] BlockStatement
src/main/utils/useBackend.js:34:21
         try {
             const response = await axios(axiosParameters);
             return response.data;
-        } catch (e) {
-            // Stryker disable next-line OptionalChaining
-            if (e.response?.data?.message) {
-                toast.error(e.response.data.message);
-            } else {
-                const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-                toast.error(errorMessage);
-            }
-            throw e;
-        }
+        } catch (e) {}
     }, {
         initialData
killedBy: RideRequestIndexPage tests what happens when you click delete, admin
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] BlockStatement
src/main/utils/useBackend.js:36:44
             return response.data;
         } catch (e) {
             // Stryker disable next-line OptionalChaining
-            if (e.response?.data?.message) {
-                toast.error(e.response.data.message);
-            } else {
+            if (e.response?.data?.message) {} else {
                 const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
                 toast.error(errorMessage);
killedBy: utils/useBackend tests utils/useBackend useBackend tests test useBackend handles 404 error correctly
statusReason: Error: Timed out in waitFor after 1000ms.

[Killed] ConditionalExpression
src/main/utils/useBackend.js:36:17
             return response.data;
         } catch (e) {
             // Stryker disable next-line OptionalChaining
-            if (e.response?.data?.message) {
+            if (false) {
                 toast.error(e.response.data.message);
             } else {
killedBy: utils/useBackend tests utils/useBackend useBackend tests test useBackend handles 404 error correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error: Request failed with status code 404"
Received: "Error communicating with backend via GET on /api/admin/users"

Number of calls: 1

[Killed] BlockStatement
src/main/utils/useBackend.js:38:20
             // Stryker disable next-line OptionalChaining
             if (e.response?.data?.message) {
                 toast.error(e.response.data.message);
-            } else {
-                const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-                toast.error(errorMessage);
-            }
+            } else {}
             throw e;
         }
killedBy: utils/useBackend tests utils/useBackend useBackend tests test useBackend handles 404 error with no message
statusReason: Error: Timed out in waitFor after 1000ms.

[Killed] BlockStatement
src/main/utils/useBackend.js:51:41
 
 
 
-const wrappedParams = async (params) => {
-    return await (await axios(params)).data;
-};
+const wrappedParams = async (params) => {};
 
 export function useBackendMutation(objectToAxiosParams, useMutationParams, queryKey = null) {
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests test useBackendMutation handles success correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New ucsbDate Created - id: 17 name: Groundhog Day"

Number of calls: 0

[Killed] ObjectLiteral
src/main/utils/useBackend.js:58:80
 export function useBackendMutation(objectToAxiosParams, useMutationParams, queryKey = null) {
     const queryClient = useQueryClient();
 
-    return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
-        onError: (error) => {
-            // Stryker disable next-line OptionalChaining : we want to check if each nested object is there but we dont want to write tests for each specific case
-            if (error.response?.data?.message) {
-                toast.error(error.response.data.message);
-            } else {
-                const errorMessage = `Error communicating with backend via ${error.response.config.method} on ${error.response.config.url}`;
-                toast.error(errorMessage);
-            }
-        },
-        // Stryker disable all: Not sure how to set up the complex behavior needed to test this
-        onSettled: () => {
-            if (queryKey !== null)
-                queryClient.invalidateQueries(queryKey);
-        },
-        // Stryker enable all
-        retry: false,
-        ...useMutationParams
-    })
+    return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {})
 }
 
killedBy: RideRequestIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Ride with id 2 was deleted"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
src/main/utils/useBackend.js:59:29
     const queryClient = useQueryClient();
 
     return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
-        onError: (error) => {
-            // Stryker disable next-line OptionalChaining : we want to check if each nested object is there but we dont want to write tests for each specific case
-            if (error.response?.data?.message) {
-                toast.error(error.response.data.message);
-            } else {
-                const errorMessage = `Error communicating with backend via ${error.response.config.method} on ${error.response.config.url}`;
-                toast.error(errorMessage);
-            }
-        },
+        onError: (error) => {},
         // Stryker disable all: Not sure how to set up the complex behavior needed to test this
         onSettled: () => {
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests test useBackendMutation handles error correctly with response message
statusReason: Error: Timed out in waitFor after 1000ms.

[Killed] ConditionalExpression
src/main/utils/useBackend.js:61:17
     return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
         onError: (error) => {
             // Stryker disable next-line OptionalChaining : we want to check if each nested object is there but we dont want to write tests for each specific case
-            if (error.response?.data?.message) {
+            if (false) {
                 toast.error(error.response.data.message);
             } else {
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests test useBackendMutation handles error correctly with response message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error: Request failed with status code 404"
Received: "Error communicating with backend via post on /api/ucsbdates/post"

Number of calls: 1

[Killed] ConditionalExpression
src/main/utils/useBackend.js:61:17
     return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
         onError: (error) => {
             // Stryker disable next-line OptionalChaining : we want to check if each nested object is there but we dont want to write tests for each specific case
-            if (error.response?.data?.message) {
+            if (true) {
                 toast.error(error.response.data.message);
             } else {
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests test useBackendMutation handles error correctly with no response message
statusReason: Error: Timed out in waitFor after 1000ms.

[Killed] BlockStatement
src/main/utils/useBackend.js:63:20
             // Stryker disable next-line OptionalChaining : we want to check if each nested object is there but we dont want to write tests for each specific case
             if (error.response?.data?.message) {
                 toast.error(error.response.data.message);
-            } else {
-                const errorMessage = `Error communicating with backend via ${error.response.config.method} on ${error.response.config.url}`;
-                toast.error(errorMessage);
-            }
+            } else {}
         },
         // Stryker disable all: Not sure how to set up the complex behavior needed to test this
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests test useBackendMutation handles error correctly with no response message
statusReason: Error: Timed out in waitFor after 1000ms.
