[Killed] StringLiteral
main/components/Shift/ShiftTable.js:18:21
             accessor: 'day',
         },
         {
-            Header: 'Shift start',
+            Header: "",
             accessor: 'shiftStart',
         },
killedBy: ShiftTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Shift start. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Shift/ShiftTable.js:31:23
         },
         {
             Header: 'Backup driver',
-            accessor: 'driverBackupID',
+            accessor: "",
         }
     ];
killedBy: ShiftTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ShiftTable-cell-row-0-col-driverBackupID"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
