[Killed] ObjectLiteral
src/main/pages/HomePage.js:8:53
     <BasicLayout>
       <div className="pt-2">
-      <div data-testid = "about-application" style={{margin:"0px 20px", backgroundColor:"#d6d2d2", padding: "20px"}}>
+      <div data-testid = "about-application" style={{}}>
       <h3>About this application</h3>
         <p>
killedBy: HomePage tests the description text has the correct CSS
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: rgb(214, 210, 210);
- margin: 0px 20px;
- padding: 20px;
