[Killed] BlockStatement
src/main/pages/PrivacyPolicyPage.js:63:33
       </div>
 `;
 
-const PrivacyPolicyPage = () => {
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <div id="privacy-policy-container" dangerouslySetInnerHTML={{__html: privacyPolicyHTML}} />
-      </div>
-    </BasicLayout>
-  );
-}
+const PrivacyPolicyPage = () => {}
 
 export default PrivacyPolicyPage;
killedBy: PageNotFound tests renders without crashing
statusReason: Error: PrivacyPolicyPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
