[Killed] StringLiteral
src/main/pages/ProfilePage.js:35:38
                     <RoleBadge role={"ROLE_MEMBER"} currentUser={currentUser}/>
                     <RoleBadge role={"ROLE_ADMIN"} currentUser={currentUser}/>
                     <RoleBadge role={"ROLE_DRIVER"} currentUser={currentUser}/>
-                    <RoleBadge role={"ROLE_RIDER"} currentUser={currentUser}/>
+                    <RoleBadge role={""} currentUser={currentUser}/>
 
                 </Col>
killedBy: ProfilePage tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="role-missing-rider"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
