[Killed] BlockStatement
main/pages/Users/MyInfoPage.js:3:38
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function MyInfoPage() {
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>My Information</h1>
-        <p>
-          This page is a placeholder; it will eventually show information about the current user.
-        </p>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function MyInfoPage() {}
killedBy: MyInfoPage tests renders without crashing
statusReason: Error: MyInfoPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
