[Killed] BlockStatement
src/main/pages/PrivacyPolicyPage.js:4:33
 import React from "react";
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-const PrivacyPolicyPage = () => {
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h2>Privacy Policy</h2>
-      </div>
-    </BasicLayout>
-  );
-}
+const PrivacyPolicyPage = () => {}
 
 export default PrivacyPolicyPage;
killedBy: PrivacyPolicyPage tests renders without crashing
statusReason: Error: PrivacyPolicyPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
